axialsimmetric/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


transportModel  Newtonian;
nu              nu   [0 2 -1 0 0 0 0]     0.01051;
Dc              Dc   [0 2 -1 0 0 0 0]        1e-5;
Dpsi            Dpsi [0 2 -1 0 0 0 0]        1e-7;
psim            psim [0 0 0 0 0 0 0]         1.09;
St              St   [0 0 1 0 0 0 0]        1e-32;
tau1            tau1 [0 0 1 0 0 0 0]         1e-2;
tau2            tau2 [0 0 1 0 0 0 0]          1e3;
crif            crif [0 -3 0 0 0 0 0]           1;
cT              cT   [0 -3 0 -1 0 0 0]          1;
Trif            Trif [0 0 0 1 0 0 0]          298;
Ti              Ti   [0 0 0 1 0 0 0]          293;
teta            teta [0 0 1 0 0 0 0]          0.5;
alfa            alfa [0 0 0 0 0 0 0]            2;
MM              MM   [1 0 0 0 0 0 0]          530;
cp              cp   [0 2 -1 -1 0 0 0]       1920; //mettere una dipendenza dalla density??
k               k    [1 1 -2 -1 0 0 0]      0.134;
as              as   [1 -3 0 -1 0 0 0]       0.65;
rho0            rho0 [1 -3 0 0 0 0 0]         855;
/*
DT              DT   [0 2 -1 0 0 0 0]    1e-5;
psifact         psifact [0 3 0 0 0 0 0 ]  2.5;
ni              ni   [-1 3 0 0 0 0 0]    1.136e-3;
*/
// ************************************************************************* //
