axialsimmetric/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default                                      backward;
}

gradSchemes
{
    default                                      Gauss linear;
}


schemeAdv upwind;

divSchemes
{
    default                                      none;
    div(phi,U)                                   Gauss $schemeAdv;
    div(phi,Uslip)                               Gauss $schemeAdv;
    div((nu*dev2(grad(U).T())))                  Gauss linear;
    div(phi,psi)                                 Gauss upwind; //Gauss linearUpwind grad(psi); //linearUpwind grad(psi);
    div(phi,c)                                   Gauss $schemeAdv; //Gauss linearUpwind grad(c);
    div(phi,T)                                   Gauss $schemeAdv;
    div(((psi*nu)*dev2(grad(Uslip).T())))        Gauss linear;
    div(phipsi,lamda)                            Gauss $schemeAdv;
    div(phi,lamda)                               Gauss $schemeAdv;
    div((nuEff*dev2(T(grad(U)))))                Gauss linear;
    div(phi,epsilon)                             Gauss upwind;
    div(phi,k)                                   Gauss upwind;
}

laplacianSchemes
{
    default                                      Gauss linear corrected;
}

interpolationSchemes
{
    default                                      linear;
}

snGradSchemes
{
    default                                      corrected;
}


// ************************************************************************* //
